const localization = {
    ua: {
        loc: 'ua',

        logout: 'Вийти',
        home: 'Головна',
        about: 'Про сторінку',
        profile: 'Профіль',

        auth: {
            signin_title: 'Вхід',
            signin: 'Увійти',
            signup_title: 'Реєстрація',
            signup: 'Зареєструватися',
            reset_title: 'Скидання пароля',
            send: 'Відправити',
            name: "Ім'я",
            email: 'Електронна адреса',
            password: 'Пароль',
            new_password: 'Новий пароль',
            repassword: 'Повторіть пароль',
            forgot_password: 'Забули пароль?',
            cancel: 'Відміна',
            signin_invalid_data: 'Пароль або емейл неправильні. Спробуйте ще раз.',
            password_mismatch: 'Введені паролі не співпадають.',
            user_already_exist: 'Користувач із такою поштою вже існує',
            signup_invalid_data: 'Не всі дані надійшли. Будь ласка, спробуйте ще раз.',
            success_send_reset: 'Ми надіслали на вашу електронну пошту повідомлення з інструкціями щодо відновлення пароля. Якщо повідомлення не надійшло, перевірте папку зі спамом',
            user_not_exist: 'Користувача з такою електронною поштою не існує',
            link_invalid: 'Посилання не валідне. Можливо його термін минув, спробуйте створити нове посилання',
            new_password_data_invalid: 'Не всі дані надіслано. Будь ласка, спробуйте ще раз.',  
        },
        
        _about: {
            title: 'Читати - це круто!',

            first_paragraph: `
                Той, хто сказав, що знання - це сила, був абсолютно правий.
                Життя змушує нас підлаштовуватися під пропоновані обставини, і найчастіше впоратися
                з ними допомагають лише напрацьовані роками навички та знання. Незважаючи на те,
                що сучасний світ пропонує нам безліч альтернативних джерел інформації, книги, як і раніше,
                залишаються кращими з них. Завдяки їм можна як дізнатися щось нове, а й навчитися якісному аналізу
                тієї чи іншої явища. 
            `,

            second_paragraph: `
                До речі, британські вчені з'ясували, що наші розумові здібності залежать від
                обсягу прочитаних за все життя книг. Дивно, але факт: між навичками читання та когнітивними
                можливостями людини простежується чітка залежність
            `
        },

        _profile: {
            add_new_book: 'Додати нову книгу',
            edit: 'Редагувати',
            follow: 'Слідкувати',
            followers: 'Слідкують',
            books: 'Книжок',
            following: 'Слідкує',
            comments: 'Коментарів',
            favorites: 'Улюбленних'
        },

        add_new_book_form: {
            title: 'Додавання нової книги',
            title_book: 'Назва',
            text: 'Текст',
            add: 'Додати',
            image: 'Обкладинка'
        },

        edit_profile_form: {
            title: 'Редагування профілю',
            name: "Ім'я",
            avatar: 'Аватарка',
            about_me: 'Про мене',
            confirm: 'Підтвердити',
        },

        book_detail: {
            remove: 'Видалити',
            favorite: 'Улюблене',
            edit: 'Редагування',
            send: 'Відправити',
            num_favorite: 'додали в улюблене'
        },

        page404: {
            title: 'Сторінка не знайдена',
            text: 'Можливо в URL адресі міститься помилка, перевірте і спробуйте знову.'
        }
    }
}

export const loc = localization.ua;